app/controllers/machine_controller.rb

SELECT * FROM "machines"
---
  def list
    @machines_list_by_type = Machine.all.group_by{|m|m.machine_types_id}

SELECT * FROM "machines"
---
  def format
    @machines = Machine.all